package Seminars;
// КОЛЛЕКЦИИ

import java.util.*;



public class Seminar5 {

    public static void main(String[] args) {
        //task0();
        //task1();
        //task2();

        //System.out.println(bookShop);

    }

     /* Задание №0
        Создать структуру для хранения Номеров паспортов и Фамилий сотрудников организации.
        123456 Иванов
        321456 Васильев
        234561 Петрова
        234432 Иванов
        654321 Петрова
        345678 Иванов

        Вывести данные по сотрудникам с фамилией Иванов.
         */
    static void task0(){

    }






}

